"""
В данном файле реализованна структура данных для раскладок
ИЦУКЕН и ДИКТОР, где ключ - буква,
значение - кортеж(1 число в кортеже - номер клавиши в ИЦУКЕНе,
2 число - номер клавиши в ДИКТОРе).
Здесь для каждого пальца левой и правой руки есть своя структура,
значение - кортеж из набора цифр клавиатуры.
То же самое реализованно и для каждого ряда клавиатуры где:
tr - Цивровой (топовый) ряд
ur - Высокий ряд
hr - Домашний ряд
lr - Низкий ряд.
Тут так же есть реализация структуры связанные с пробелом и шифтами.
Здесь же реализованны словари раскладок ИЦУКЕН и ДИКТОР
для функции translation().
В Этом файле так же есть переменные, которые используется 
для нахождения больших букв в тексте:
big_bukva - список всех больших букв
left_shift_QWERTY - большие буквы для левого шифта в раскладке ИЦУКЕН
left_shift_diktor - большие буквы для левого шифта в раскладке Дикторе
right_shift_QWERTY - большие буквы для правый шифта в раскладке ИЦУКЕН
right_shift_diktor - большие буквы для правый шифта в раскладке Дикторе
так же есть переменные которые содержат буквы, которые набиваются 
с помощью левого или правого шифта:
l_s_QWERTY - левый шифт для ИЦУКЕНА
l_s_diktor - левый шифт для Диктор
r_s_QWERTY - правый шифт для ИЦУКЕНА
r_s_diktor - правый шифт для Диктор
"""
lfi1 = (57)
lfi2 = (47, 48, 33, 34, 19, 20, 5, 6)
lfi3 = (46, 32, 18, 4)
lfi4 = (45, 31, 17, 3)
lfi5 = (44, 30, 16, 2, 41, 15, 58, 42, 29)

rfi1 = (57)
rfi2 = (49, 50, 35, 36, 21, 22, 7, 8)
rfi3 = (51, 37, 23, 9)
rfi4 = (52, 38, 24, 10)
rfi5 = (53, 39, 40, 25, 26, 27, 11, 12, 13, 14, 43, 28, 54)

tr = (41, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 43, 14)
ur = (16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27)
hr = (30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40)
lr = (44, 45, 46, 47, 48, 49, 50, 51, 52, 53)

big_bukva = "ЁЙЦУКЕФЫВАПЯЧСМИЦУФЭИЯЕХОАЮЫЁЪЬ"
left_shift_QWERTY = "ЁЙЦУКЕФЫВАПЯЧСМИ"
left_shift_diktor = "ЦУФЭИЯЕХОАЮЫЁЪЬ"
left_shift_vyzov = "ЯВЕРТАСДФГЗЬЦЖБ"
left_shift_skoropis = "ЦЬЯ,.УИЕОАФЭХЫЮ"

right_shift_QWERTY = "НГШЩЗХЪРОЛДЖЭТЬБЮ"
right_shift_diktor = "ЗЛБВНМКТПДСГЧРЖШЙЩ"
right_shift_vyzov = "ЫУИОПШЩЭХЙКЛ;'"
right_shift_skoropis = 'ЗВКДЧШЩЛНТСРЙБМПГЖ"'

l_s_QWERTY = "ёйцукефывапячсми12345!№;%:"
l_s_diktor = "цуфэияехоаюыёьь12345%:!?,"
l_s_vyzov = "ю12345явертасдфгзьцжб"
l_s_skoropis = "*.ёъ?!цья,уиеоафэхыю"

r_s_QWERTY = "нгшщзхьролджэтьбю7890-=?*(),."
r_s_diktor = "злбвнмктпдсгчржшйщ67890-=*+()"
r_s_vyzov = "ыуиопшщэхйкл:нм,./"
r_s_skoropis = "-'()_звкдчшщлнтсрйбмпгж"

cyr = {'а': (33, 34, 30, 34), 'б': (51, 49, 48, 49),
       'в': (32, 22, 17, 22), 'г': (22, 52, 34, 52),
       'д': (38, 24, 38, 24), 'е': (20, 32, 30, 32),
       'ё': (41, 41, 5, 3), 'ж': (39, 53, 47, 53),
       'з': (25, 21, 44, 21), 'и': (48, 31, 23, 31),
       'й': (16, 40, 36, 40), 'к': (19, 23, 37, 23),
       'л': (37, 35, 38, 35), 'м': (47, 50, 50, 50),
       'н': (21, 36, 49, 36), 'о': (36, 33, 24, 33),
       'п': (34, 51, 25, 51), 'р': (35, 39, 19, 39),
       'с': (46, 38, 31, 38), 'т': (49, 37, 20, 37),
       'у': (18, 32, 22, 30), 'ф': (30, 44, 33, 44),
       'х': (26, 46, 35, 46), 'ц': (17, 16, 17, 16),
       'ч': (45, 25, 13, 25), 'ш': (23, 26, 26, 26),
       'щ': (24, 27, 24, 27), 'ъ': (27, 17, 27, 4),
       'ы': (31, 47, 31, 47), 'ь': (50, 17, 45, 17),
       'э': (40, 45, 40, 45), 'ю': (52, 48, 52, 48),
       'я': (44, 18, 44, 18), '1': (2, 2, 2, 2),
       '2': (3, 3, 3, 3), '3': (4, 4, 4, 4),
       '4': (5, 5, 5, 5),'5': (6, 6, 6, 6),
       '6': (7, 7, 7, 7),
       '7': (8, 8, 8, 8), '8': (9, 9, 9, 9),
       '9': (10, 10, 10, 10), '0': (11, 11, 11, 11),
       '-': (12, 12, 12, 12), '=': (13, 13, 12, 13),
       ' ': (57, 57, 57, 57), ',': (51, 19, 19, 19),
       '.': (52, 20, 20, 20), ':': (39, 6, 6, 39),
       '!': (0, 20, 20, 7), '"': (39, 9, 9, 39),
       ';': (39, 7, 7, 39), '+': (13, 13, 13, 13),
       '*': (9, 12, 12, 41), '%': (6, 5, 5, 4),
       '№': (4, 4, 4, 4), '(': (10, 10, 10, 10),
       ')': (11, 11, 11, 11), '?': (8, 19, 19, 6)
       }

fingers_map_QWERTY = {ord("а"): "lfi2,hr,33,5,", ord("б"): "rfi3,lr,51,8,",
                      ord("в"): "lfi3,hr,32,4,", ord("г"): "rfi2,ur,22,8,",
                      ord("д"): "rfi4,hr,38,10,", ord("е"): "lfi2,hr,20,6,",
                      ord("ё"): "lfi5,tr,41,1,", ord("ж"): "rfi5,hr,39,11,",
                      ord("з"): "rfi5,ur,25,11,", ord("и"): "lfi2,lr,48,6,",
                      ord("й"): "lfi5,ur,16,2,", ord("к"): "lfi2,ur,19,5,",
                      ord("л"): "rfi3,hr,37,9,", ord("м"): "lfi2,lr,47,5,",
                      ord("н"): "rfi2,ur,21,7,", ord("о"): "rfi2,hr,36,8,",
                      ord("п"): "lfi2,hr,34,6,", ord("р"): "rfi2,hr,35,7,",
                      ord("c"): "lfi3,lr,46,4,", ord("т"): "rfi2,lr,49,7,",
                      ord("у"): "lfi3,ur,18,4,", ord("ф"): "lfi5,hr,30,2,",
                      ord("х"): "lfi4,ur,26,12,", ord("ц"): "lfi4,lr,17,3,",
                      ord("ч"): "lfi4,lr,45,3,", ord("ш"): "rfi3,ur,23,9,",
                      ord("щ"): "rfi3,ur,24,10,", ord("ъ"): "rfi5,ur,27,13,",
                      ord("ы"): "lfi4,hr,31,3,", ord("ь"): "rfi2,lr,50,8,",
                      ord("э"): "rfi5,hr,40,12,", ord("ю"): "rfi4,lr,52,10,",
                      ord("я"): "lfi5,lr,44,2,", ord("1"): "lfi5,tr,2,2,",
                      ord("2"): "lfi4,tr,3,3,", ord("3"): "lfi3,tr,4,4,",
                      ord("4"): "lfi2,tr,5,5,", ord("5"): "lfi2,tr,6,6,",
                      ord("6"): "rfi2,tr,7,7,", ord("7"): "rfi2,tr,8,8,",
                      ord("8"): "rfi3,tr,9,9,", ord("9"): "rfi4,tr,10,10,",
                      ord("0"): "rfi5,tr,11,11,", ord("-"): "rfi5,tr,12,12,",
                      ord("="): "rfi5,tr,13,13,", ord(','): "rfi3,lr,51,5,",
                      ord('.'): "rfi5,lr, 52,10,", ord(':'): "rfi5,hr, 39,7,",
                      ord('!'): "lfi5,tr, 0,2,", ord('"'): "rfi5,hr, 39,12,",
                      ord(';'): "rfi5,hr, 39,11,", ord('+'): "rfi5,tr, 13,13,",
                      ord('*'): "rfi3,tr, 9,9,", ord('%'): "lfi2,tr, 4,6,",
                      ord('№'): "lfi3,tr, 4,4,", ord('('): "rfi4,tr, 10,10,",
                      ord(')'): "rfi5,tr, 11,11,", ord('?'): "rfi2,tr, 8,8,"}

fingers_map_vyzov =  {ord("а"): "lfi2,hr,30,2,", ord("б"): "rfi1,lr,48,6",
                      ord("в"): "lfi3,ur,17,3,", ord("г"): "lfi1,hr,34,6,",
                      ord("д"): "rfi3,hr,32,4,", ord("е"): "lfi3,ur,18,4,",
                      ord("ё"): "lfi1,tr,5,5,", ord("ж"): "lfi1,lr,47,5,",
                      ord("з"): "lfi5,lr,44,2,", ord("и"): "rfi4,ur,23,9,",
                      ord("й"): "rfi2,hr,36,8,", ord("к"): "rfi3,hr,37,9,",
                      ord("л"): "rfi4,hr,38,10,", ord("м"): "lfi2,lr,50,8,",
                      ord("н"): "rfi2,lr,49,7,", ord("о"): "rfi4,ur,24,10,",
                      ord("п"): "rfi5,ur,25,11,", ord("р"): "lfi1,ur,19,5,",
                      ord("c"): "lfi4,hr,31,3,", ord("т"): "lfi2,ur,20,6,",
                      ord("у"): "rfi2,ur,22,8,", ord("ф"): "lfi2,hr,33,5,",
                      ord("х"): "rfi2,hr,35,7,", ord("ц"): "lfi3,lr,46,4,",
                      ord("ч"): "rfi5,tr,13,13,", ord("ш"): "rfi5,ur,26,12,",
                      ord("щ"): "rfi5,ur,27,13,", ord("ъ"): "rfi2,tr,6,6,",
                      ord("ы"): "rfi2,ur,21,7,", ord("ь"): "lfi4,lr,45,3,",
                      ord("э"): "rfi5,ur,43,13,", ord("ю"): "lfi5,tr,41,1,",
                      ord("я"): "lfi5,ur,16,2,", ord("1"): "lfi5,tr,2,2,",
                      ord("2"): "lfi4,tr,3,3,", ord("3"): "lfi3,tr,4,4,",
                      ord("4"): "lfi2,tr,5,5,", ord("5"): "lfi2,tr,6,6,",
                      ord("6"): "rfi2,tr,7,7,", ord("7"): "rfi2,tr,8,8,",
                      ord("8"): "rfi3,tr,9,9,", ord("9"): "rfi4,tr,10,10,",
                      ord("0"): "rfi5,tr,11,11,", ord("-"): "rfi5,tr,12,12,",
                      ord("="): "rfi5,tr,13,13,", ord(','): "rfi3,lr,51,5,",
                      ord('.'): "rfi5,lr,52,10,", ord(':'): "rfi5,hr, 39,7,",
                      ord('!'): "lfi5,tr,0,2,", ord('"'): "rfi5,hr,39,12,",
                      ord(';'): "rfi5,hr,39,11,", ord('+'): "rfi5,tr,13,13,",
                      ord('*'): "rfi3,tr,9,9,", ord('%'): "lfi2,tr,4,6,",
                      ord('№'): "lfi3,tr,4,4,", ord('('): "rfi4,tr,10,10,",
                      ord(')'): "rfi5,tr,11,11,", ord('?'): "rfi2,tr,8,8,"}

fingers_map_skoropis={ord("а"): "lfi2,hr,34,6,", ord("б"): "rfi2,lr,49,7,",
                      ord("в"): "rfi2,ur,22,8,", ord("г"): "rfi4,lr,52,9,",
                      ord("д"): "rfi4,ur,24,10,", ord("е"): "lfi3,hr,32,4,",
                      ord("ё"): "lfi4,tr,3,3,", ord("ж"): "rfi5,lr,53,11,",
                      ord("з"): "rfi2,ur,21,7,", ord("и"): "lfi4,hr,31,3,",
                      ord("й"): "rfi5,hr,40,12,", ord("к"): "rfi3,ur,23,9,",
                      ord("л"): "rfi2,hr,35,7,", ord("м"): "rfi2,lr,50,8,",
                      ord("н"): "rfi2,hr,36,8,", ord("о"): "lfi2,hr,33,5,",
                      ord("п"): "lfi3,lr,51,9,", ord("р"): "rfi5,hr,39,11,",
                      ord("c"): "rfi3,hr,38,10,", ord("т"): "rfi3,hr,37,9,",
                      ord("у"): "lfi5,hr,30,2,", ord("ф"): "lfi5,lr,44,2,",
                      ord("х"): "lfi3,lr,46,4,", ord("ц"): "lfi5,ur,16,2,",
                      ord("ч"): "rfi5,ur,25,11,", ord("ш"): "rfi5,ur,26,12,",
                      ord("щ"): "rfi5,ur,27,13,", ord("ъ"): "lfi3,tr,4,4,",
                      ord("ы"): "lfi2,lr,47,5,", ord("ь"): "lfi4,ur,17,3,",
                      ord("э"): "lfi4,lr,45,3,", ord("ю"): "lfi2,lr,48,6,",
                      ord("я"): "lfi3,ur,18,4,", ord("1"): "lfi5,tr,2,2,",
                      ord("2"): "lfi4,tr,3,3,", ord("3"): "lfi3,tr,4,4,",
                      ord("4"): "lfi2,tr,5,5,", ord("5"): "lfi2,tr,6,6,",
                      ord("6"): "rfi2,tr,7,7,", ord("7"): "rfi2,tr,8,8,",
                      ord("8"): "rfi3,tr,9,9,", ord("9"): "rfi4,tr,10,10,",
                      ord("0"): "rfi5,tr,11,11,", ord("-"): "rfi5,tr,12,12,",
                      ord("="): "rfi5,tr,13,13,", ord(','): "lfi2,ur,19,5,",
                      ord('.'): "lfi2,ur, 20,6,", ord(':'): "rfi5,hr, 39,7,",
                      ord('!'): "lfi2,tr, 7,6,", ord('"'): "rfi5,hr, 39,12,",
                      ord(';'): "rfi5,hr, 39,11,", ord('+'): "rfi5,tr, 13,13,",
                      ord('*'): "lfi5,tr, 41,1,", ord('%'): "lfi2,tr, 4,6,",
                      ord('№'): "lfi3,tr, 4,4,", ord('('): "rfi4,tr, 10,10,",
                      ord(')'): "rfi5,tr, 11,11,", ord('?'): "lfi2,tr,6,5,"}

fingers_map_diktor = {ord("а"): "lfi2,hr,34,6,", ord("б"): "rfi2,lr,50,7,",
                      ord("в"): "rfi2,ur,22,8,", ord("г"): "rfi4,lr,52,10,",
                      ord("д"): "rfi4,ur,24,10,", ord("е"): "lfi3,hr,32,4,",
                      ord("ё"): "lfi5,tr,41,1,", ord("ж"): "rfi5,lr,53,11,",
                      ord("з"): "rfi2,ur,21,7,", ord("и"): "lfi4,hr,31,3,",
                      ord("й"): "rfi5,hr,40,12,", ord("к"): "rfi3,ur,23,9,",
                      ord("л"): "rfi2,hr,35,7,", ord("м"): "rfi3,lr,50,8,",
                      ord("н"): "rfi2,hr,36,8,", ord("о"): "lfi2,hr,33,5,",
                      ord("п"): "rfi2,lr,51,9,", ord("р"): "rfi5,hr,39,11,",
                      ord("c"): "rfi3,hr,38,10,", ord("т"): "rfi2,hr,37,9,",
                      ord("у"): "lfi5,hr,30,2,", ord("ф"): "lfi5,lr,44,2,",
                      ord("х"): "lfi3,lr,46,4,", ord("ц"): "lfi5,ur,16,2,",
                      ord("ч"): "rfi5,ur,25,11,", ord("ш"): "rfi5,ur,26,12,",
                      ord("щ"): "rfi5,ur,27,13,", ord("ъ"): "lfi5,tr,2,3,",
                      ord("ы"): "lfi2,lr,47,5,", ord("ь"): "lfi4,tr,3,3,",
                      ord("э"): "rfi4,lr,45,3,", ord("ю"): "lfi2,lr,48,6,",
                      ord("я"): "lfi3,ur,18,4,", ord("1"): "lfi5,tr,2,2,",
                      ord("2"): "lfi4,tr,3,3,", ord("3"): "lfi3,tr,4,4,",
                      ord("4"): "lfi2,tr,5,5,", ord("5"): "lfi2,tr,6,6,",
                      ord("6"): "rfi2,tr,7,7,", ord("7"): "rfi2,tr,8,8,",
                      ord("8"): "rfi3,tr,9,9,", ord("9"): "rfi4,tr,10,10,",
                      ord("0"): "rfi5,tr,11,11,", ord("-"): "rfi5,tr,12,12,",
                      ord("="): "rfi5,tr,13,13,", ord(','): "lfi2,ur,19,5,",
                      ord('.'): "lfi2,ur, 20,6,", ord(':'): "lfi2,tr, 6,6,",
                      ord('!'): "lfi2,ur, 20,6,", ord('"'): "rfi3,tr, 9,9,",
                      ord(';'): "rfi2,tr, 7,7,", ord('+'): "rfi5,tr, 13,13,",
                      ord('*'): "rfi5,tr, 12,12,", ord('%'): "lfi2,tr, 5,5,",
                      ord('№'): "lfi3,tr, 4,4,", ord('('): "rfi4,tr, 10,10,",
                      ord(')'): "rfi5,tr, 11,11,", ord('?'): "lfi2,ur, 19,5,"}
